Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.CanBeDivisionProfile(Autodesk.Revit.DB.ElementId)
Checks whether a family defines a profile which can be used by this method.
familyId:
Element id of the family.
Returns:
True if the family defines a profile which can be used by a part maker,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.CanBeDivisionProfile(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Checks whether a family defines a profile which can be used by this method.
familyId:
Element id of the family.
familyDocument:
The document containing the family to be tested.
Returns:
True if the family defines a profile which can be used by a part maker,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.RemoveIntersectingReference(Autodesk.Revit.DB.ElementId)
Removed intersecting reference.
intersectingReference:
Id of the intersecting reference to remove.
Returns:
True if the PartMaker used this intersecting reference and
this call removed it, false if the PartMaker did not use this
intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AddIntersectingReference(Autodesk.Revit.DB.ElementId,System.Double)
Adds intersecting reference with an offset.
intersectingReference:
Id of the new intersecting reference.
offset:
The Offste for the new intersecting reference.
Returns:
True if the PartMaker did not already use this
intersecting reference and it was added, false if the PartMaker
already used this intersecting reference and this call
only updated its offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id was not permitted as intersecting references.
Intersecting references should be levels, grids, or reference planes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetOffsetForIntersectingReference(Autodesk.Revit.DB.ElementId)
Gets offset for the intersecting reference.
intersectingReference:
The intersecting reference to obtain offset value from.
Returns:
The offset for the intersecting reference
Throws Autodesk.Revit.Exceptions.ArgumentException:
PartMaker does not use the specified intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.SetOffsetForIntersectingReference(Autodesk.Revit.DB.ElementId,System.Double)
Sets offset for the intersecting reference.
intersectingReference:
The intersecting reference that will be offset.
offset:
The new offset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
PartMaker does not use the specified intersecting reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.UsesReference(Autodesk.Revit.DB.ElementId)
Identifies if the PartMaker uses the intersecting reference.
intersectingReference:
Intersecting reference to be tested.
Returns:
True if the intersecting reference is used by the PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsValidSketchPlane(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if provided sketch plane is valid.
document:
The document.
sketchPlaneId:
SketchPlane ids to be tested for validity for PartMaker.
Returns:
True if SketchPlane valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
document:
The document.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Identifies if provided members are valid.
elementIds:
Element ids to be tested for validity for intersecting references.
Returns:
True if all references are valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies if the provided member is valid.
document:
The document.
elementId:
Element ids to be tested for validity for intersecting references.
Returns:
True if the reference is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.IsElementValidIntersectingReference(Autodesk.Revit.DB.ElementId)
Identifies if the provided member is valid.
elementId:
Element ids to be tested for validity for intersecting references.
Returns:
True if the reference is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.DivisionRuleId
Id of the 'DivisionRule' which is used to augment the cutting sketch.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The provided element id cannot be assigned as a division rule
to this PartMakerMethodToDivideVolumes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileType
The id of the profile family applied to boundaries between parts.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013